import Navbar from "../components/Navbar";
import Footer from "../components/Footer";
import { Helmet, HelmetProvider } from "react-helmet-async";
import { useEffect } from "react";

const TermsAndConditions = () => {
  let search = window.location.search;
  let params = new URLSearchParams(search);
  let id = params.get("id");

  // ============= FACEBOOK & GOOGLE LOGIN DATA ==============
  useEffect(() => {
    if (id) {
      window.history.pushState({}, document.title, "/termsAndConditions");
    }
  }, [id]);

  return (
    <>
      <HelmetProvider>
        <Helmet>
          <title>愛課網</title>
          <link rel="shortcut icon" type="image/png" href="/favicon.ico" />
          <meta name="description" content="愛課網" />
        </Helmet>
        <Navbar />
        <div className="wrap">
          <div className="tnc">
            <h2 className="nonselect">使用條款</h2>
          </div>
          <section className="agreeContent container">
            <h4>1.協議</h4>
            <ul>
              <li>
                1.1
                您對本網站及其服務和程序的使用將受這些條款和條件的約束。這些條款和條件構成了您和愛客網之間的協議。
              </li>
              <li>
                1.2
                愛客網可能會不時修改這些條款和條件。訪問本網站即表示您在訪問和/或使用本網站時必須遵守網站上公佈的條款和條件。
              </li>
              <li>
                1.3
                由負責維護網站的管理員簽署的證書將初步證明發布日期和當前版本的內容以及條款和條件的所有先前版本。
              </li>
            </ul>
            <h4>2.提供信息的正確性</h4>
            <ul>
              <li>
                2.1因為我們在非面對面的環境中相互交往，所以您特此允許愛客網及其在線合作夥伴依賴以下事實：
                <ul>
                  <li>2.1.1 您提供的所有細節都是真實無誤的;</li>
                  <li>2.1.2 您在法律上有能力在本網站上完成任何交易;</li>
                  <li>2.1.3 您已閱讀，理解並接受這些條款和條件 </li>
                </ul>
              </li>
              <li>
                2.2
                愛客網必須有權依賴看來似乎來自你的指示，即使他們來自冒充你的其他人，除非你通知我們有任何違規行為，對任何聲稱來自你的指示採取行動。
              </li>
            </ul>
            <h4>3.網站信息的性質</h4>
            <p>
              除非另有明確規定，否則網站上的所有資料僅構成開展業務的邀請，且不是進行任何交易的要約。
            </p>
            <h4>4.終止註冊或使用本網站或服務</h4>
            <p>
              愛客網也可以自行決定在任何時候停止提供網站或程序及其他服務或其任何部分，無論是否通知。
            </p>
            <h4>5.鏈接的第三方網站和第三方內容</h4>
            <ul>
              <li>
                5.1愛客網，其承包商，代理商，所有者和員工不對其可能鏈接的任何網站的合同或隱私政策負責。
              </li>
              <li>
                5.2愛客網對於因使用本網站的任何鏈接訪問而可能遭受的任何損失或損害不承擔任何責任。
              </li>
            </ul>
            <h4>6.披露</h4>
            <p>
              根據2002年電子通信和交易法案25（“ECT法案”），對愛客網網站提供的服務，內容，軟件和內容下載的訪問被歸
              為“電子交易”，因此用戶擁有詳細的權利在ECT法案第7章和教我2中有義務披露以下信息：
            </p>
            <ul>
              <li>
                6.1網站所有者的全名和法律地位： -
                愛客網輔導CC，（註冊號：2007/250990/23）
              </li>
              <li>6.2街道地址： 台灣省高雄市鼓山區文忠路46號3樓;</li>
              <li>6.4郵政地址： 台灣省高雄市鼓山區文忠路46號3樓;</li>
              <li>
                6.5接收法律服務的實際地址： 台灣省高雄市鼓山區文忠路46號3樓;{" "}
              </li>
              <li>
                6.6主要業務：出售，開展和管理私人補習服務，以提高學生的學業成績和一般學術能力;{" "}
              </li>
              <li>6.7愛客網網站的網址是http://www.acabook.com/ </li>
              <li>6.8愛客網網站的官方電子郵件地址是http://www.acabook.com/ </li>
              <li>6.9自律或認可機構的成員資格 </li>
              <li>6.10愛客網網站訂閱的行為準則：行為準則和IT道德準則; </li>
              <li>6.11適用條款; </li>
              <li>6.12根據2000年第2號“促進信息獲取法”第51節公佈的手冊副本</li>
              <li>6.13管理層：董事： </li>
              <li>6.14與訪問和使用Teach Me 2網站相關的費用如下：免費</li>
              <li>
                6.15替代性爭議解決：在緊急和/或臨時救濟的情況下，所有爭議均涉及：
                <ul>
                  <li>6.15.1訪問愛客網網站; </li>
                  <li>6.15.2無法訪問愛客網網站; </li>
                  <li>6.15.3愛客網提供的服務和內容; 要么</li>
                  <li>6.15.4這些條款和條件; </li>
                  <p>
                    應根據南非仲裁基金會的快速規則提交仲裁，此類仲裁程序應在開普敦以英語進行。仲裁裁決是終局的，不成功的一方應按照律師與自己的客戶之間的規模支付成功方的費用。{" "}
                  </p>
                </ul>
              </li>
              <li>
                6.16冷靜期：就ECT法第42（1）（d）條的運作而言，ECT法的冷卻條款不適用於本網站;{" "}
              </li>
              <li>
                6.17用戶可通過本網站提供的“聯繫我們”服務向Teach Me
                2網站提出投訴。用戶特此將此類投訴的版權轉讓給“愛客網”，並了解“愛客網”可能會使用，披露和發布此類投訴，而且沒有法律義務來回答，解決或解決此類投訴。
              </li>
            </ul>
            <h4>7.免責聲明</h4>
            <ul>
              <li>
                7.1出現在這些頁面上的所有信息均未提供任何明示或暗示的任何陳述或保證，並且不會對愛客網承擔任何與此相關的責任。
              </li>
              <li>
                7.2愛客網對由於這些頁面上提供的信息或由此產生的任何行動和/或交易引起的任何直接，間接或後果性損失不承擔任何責任。{" "}
              </li>
              <li>
                7.3愛客網並不保證本網站提供的功能不會中斷或沒有錯誤，或者網站或提供此功能的服務器沒有病毒或其他有害成分。{" "}
              </li>
              <li>
                7.4愛客網網站按“原樣”提供，並未編譯以滿足用戶的個人要求。在與愛客網簽訂本協議之前，用戶有責任讓自己滿意，通過愛客網網站提供的內容滿足用戶的個性化要求，並與用戶的計算機硬件和/兼容或軟件。{" "}
              </li>
              <li>
                7.5在愛客網網站上表達的信息，想法和觀點不應被視為專業建議或愛客網的官方意見，並鼓勵用戶在採取與信息，想法或相關的任何行動之前看到專業建議。在愛客網網站上發表的意見。{" "}
              </li>
              <li>
                7.6愛客網不保證教學我2網站提供的內容和服務在任何情況下都是真實，正確或沒有任何錯誤。愛客網應採取所有合理步驟，以確保教學我2網站提供的內容的質量和準確性，並鼓勵用戶根據教學我2的權利報告錯誤和不真實的信息，以依賴其自由表達權並確定，本網站內容全
                權酌情決定。
              </li>
            </ul>
            <h4>8.管轄法律</h4>
            <p>
              與這些頁面或網站上出現的任何服務有關的條款和條件應受到南非共和國法律的管轄和解釋，並且對這些頁面或網站上提供的任何服務的申請將構成您的同意並提交至南非法院對任何一方對另一方提起的所有訴訟，交易，申請等的管轄權，均源於與此類服務有關的任何條款和條件。
            </p>
            <h4>9.隱私政策</h4>
            <ul>
              <li>
                9.1愛客網應採取一切合理步驟保護用戶的個人信息，並且就本條款而言，“個人信息”的定義應詳見“2000年信息獲取促進法案”（PAIA）。{" "}
              </li>
              <li>
                9.2愛客網可以電子方式收集，存儲和使用以下用戶信息：
                <ul>
                  <li>9.2.1姓名 </li>
                  <li>9.2.2聯繫方式 </li>
                  <li>9.2.3電子郵件地址 </li>
                </ul>
              </li>
              <li>
                9.3愛客網收集，存儲和使用上述信息用於以下目的：
                <ul>
                  <li>9.3.1向用戶傳達所要求的信息; </li>
                  <li>9.3.2用戶的註冊和/或認證; 和 </li>
                  <li>
                    9.3.3編制有關瀏覽習慣和訪問愛客網網站的非個人統計信息。{" "}
                  </li>
                </ul>
              </li>
              <li>
                9.4上述詳細信息通過使用cookie以電子方式收集或由用戶自願提供。{" "}
              </li>
              <li>
                9.5愛客網可以收集，維護，保存，編輯，分享，披露和出售從用戶收集的任何信息，但須符合以下規定：
                <ul>
                  <li>9.5.1愛客網不得向用戶披露個人信息，除非用戶同意; </li>
                  <li>
                    9.5.2愛客網應僅在未經用戶同意的情況下通過適當的法律程序披露信息;
                    和{" "}
                  </li>
                </ul>
              </li>
              <li>
                9.6愛客網擁有並保留對教學我收集和編輯的非個人統計信息的所有權利2。{" "}
              </li>
              <li>
                9.7當您在我們的網站上填寫表格以查詢我們服務的某些方面時，我們會收集此信息以便我們處理您的請求並向您提供您所要求的信息。愛客網或
                我們的導師和分包商可以通過郵寄，電子郵件或電話與您聯繫，詢問您對我們服務的反饋和意見。我們還可能希望向您提供有關我們網站的特殊
                功能或我們認為您可能感興趣的任何其他服務或產品的信息。如果您不想收到此信息，請發送電子郵件至http://www.acabook.com/確認您的請求。{" "}
              </li>
              <li>
                9.8通過提交您的信息，您同意使用本政策中規定的信息。如果我們更改了隱私政策，我們將在此頁面上發布更改，並可能會在網站的其他頁面上
                發布通知，以便您可以隨時了解我們收集的信息以及我們如何使用它們。繼續使用該服務即表示您同意任何此類更改。
              </li>
            </ul>
            <h4>10.版權</h4>
            <ul>
              <li>
                10.1愛客網保留所有材料的所有版權，包括構成本網站一部分以及其程序的徽標和其他圖形。嚴格禁止未經明確授權在本網站上使用任何
                材料，並構成非法侵犯愛客網的知識產權。{" "}
              </li>
              <li>
                10.2愛客網對因內容或由此造成的任何損害的任何錯誤，遺漏，中斷或延遲不承擔任何責任。
              </li>
            </ul>
            <h4>11.終止</h4>
            <p>
              如果您認為您的行為違反或不符合這些條款和條件，則愛客網可以自行決定終止您訪問本網站，取消您的訂單或行使任何​​其他補救措施。
            </p>
          </section>
          <Footer />
        </div>

        <style jsx="true">
          {`
            .tnc h2 {
              font-weight: bold;
              font-size: 2.5em;
              margin-bottom: 30px;
              color: #fff;
              background-color: #323232;
              padding: 10px 0px;
              text-align: center;
              border: none;
              z-index: -1;
            }

            .wrap .agreeContent {
              padding: 40px 10px;
            }

            .wrap .agreeContent h2 {
              font-weight: bold;
              font-size: 2.5em;
              margin-bottom: 30px;
            }

            .wrap .agreeContent h3 {
              font-weight: bold;
              margin: 30px 0 10px 0;
            }

            .wrap .agreeContent h4 {
              font-weight: bold;
              margin: 30px 0 10px 0;
            }

            .wrap .agreeContent p {
              font-size: 14px;
              margin-bottom: 0;
            }
            .wrap .agreeContent a {
              color: #008489;
              text-decoration: none;
              font-weight: 700;
            }
            .wrap .container {
              text-align: left;
            }
          `}
        </style>
      </HelmetProvider>
    </>
  );
};

export default TermsAndConditions;
